import stanford.karel.Karel;

public class problem01 extends Karel {

//	5. კარელი დგას 1x1 უჯრაზე, შეავსებინეთ მას პირველი ქუჩა ბრილიანტებით. ანუ პირველი
//	ქუჩის ყველა უჯრაზე უნდა იდოს ზუსტად ერთი ბრილიანტი. ჩათვალეთ რომ საწყისი
//	სამყარო ცარიელი არ არის და გარკვეულ(ჩვენთვის უცნობ) უჯრებში თითო(მხოლოდ ერთი)
//	ბრილიანტი დევს.
//	6. კარელმა უნდა შეკრიბოს ორი რიცხვი, 2x1 უჯრაზე დევს n ცალი ბრილიანტი, 3x1 უჯრაზე m
//	ცალი ბრილიანტი, კარელმა 4x1 უჯრაზე უნდა დადოს n+m ბრილიანტი. ჩათვალეთ, რომ
//	კარელს ჩანთაში უსასრულო რაოდენობის ბრილიანტი აქვს.
//	
	
	
	  public void run(){
		
		 
	//N2	 
//		for (int i = 0; i < 4; i++) {
//			move(); 
//			}
//		for (int i = 0; i < 10; i++) {
//			pickBeeper(); 
//			}
//		move();
//		
//		for (int i = 0; i < 10; i++) {
//			putBeeper(); 
//			}
		
	//3-4
	while (frontIsClear() ){
		putBeeper();
		move();
	}
	putBeeper();
	
	
		
		  
		  
		  
		  
		  
		  
		  
		  
		  
		
		
		
		
	}
	
	
	
}
